Enums/ЛБ_ВидыОперацийДоверенность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийДоверенность</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наследство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отзыв</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийДоверенность/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;   
	ДанныеВыбора = Новый СписокЗначений;  
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийДоверенность.Оформление")); 
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийДоверенность.Отзыв"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийДоверенность.Ошибка"));
КонецПроцедуры
